Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:AdjustPoint edc:offset="0xc" edc:_addr="0x1FC03F50"/>
      <edc:DCRDef edc:access="---n----------------------------" edc:cname="ADEVCP" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x10000000" edc:name="ADEVCP" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x10000000" edc:default="0xffffffff" edc:_addr="0x1FC03F5C">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="28"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0" edc:checksumalgo="0x80" edc:endaddr="0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0" edc:checksumalgo="0x0" edc:endaddr="0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="0xc" edc:_addr="0x1FC03F60"/>
      <edc:DCRDef edc:access="--------------------------------" edc:cname="ADEVSIGN" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x0" edc:name="ADEVSIGN" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000" edc:default="0x7fffffff" edc:_addr="0x1FC03F6C">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ASEQ" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="ASEQ" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff" edc:default="0xffffffff" edc:_addr="0x1FC03F70">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:AltConfigFuseSector edc:beginaddr="0x1fc23f30" edc:endaddr="0x1fc23f80" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="upperbootaliasaltconfig" edc:regionidref="lowerbootaliasconfig" edc:registerprefix="AUBA">
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x1FC23F30"/>
      <edc:DCRDef edc:access="nnnnn---nn-n----nnnnnnnnnnnnnnnn" edc:cname="AUBADEVCFG3" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xf8d0ffff" edc:name="AUBADEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffff0000" edc:default="0xffffffff" edc:_addr="0x1FC23F40">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:DCRFieldDef edc:cname="PWMLOCK" edc:desc="PWM IOxCON lock" edc:mask="0x1" edc:name="PWMLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM IOxCON register write accessess must use the PWMKEY unlock proceedure" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM IOxCON register writes accesses are not locked or protected" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="FUSBIDIO2" edc:desc="USB2 USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB2 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO2" edc:desc="USB2 VBUSON Selection bit" edc:mask="0x1" edc:name="FVBUSIO2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUSON pin is controlled by the USB2 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUSON pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="PGL1WAY" edc:desc="Permission Group Lock One Way Configuration bit" edc:mask="0x1" edc:name="PGL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FUSBIDIO1" edc:desc="USB1 USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO1" edc:desc="USB2 VBUSON Selection bit" edc:mask="0x1" edc:name="FVBUSIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUSON pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUSON pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
