Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="cccccccccccccccccccccccccccccccc" edc:cname="CHEHIT" edc:desc="" edc:grp="CACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="CHEHIT" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2_WACK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F800820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEHIT" edc:desc="" edc:mask="0xffffffff" edc:name="CHEHIT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="cccccccccccccccccccccccccccccccc" edc:cname="CHEMIS" edc:desc="" edc:grp="CACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="CHEMIS" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2_WACK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F800830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEMIS" edc:desc="" edc:mask="0xffffffff" edc:name="CHEMIS" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C0" edc:_addr="0x1F800840"/>
      <edc:SFRDef edc:access="----------------nnnn----nn--nnnn" edc:cname="NVMCON" edc:desc="" edc:grp="NVM" edc:impl="0xfffff7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000----0x--0000" edc:name="NVMCON" edc:nzwidth="0x20" edc:por="----------------0000----0x--0000" edc:portals="CLR SET INV" ltx:baseofperipheral="NVM" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb0" edc:_addr="0x1F800A00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMOP" edc:desc="" edc:mask="0xf" edc:name="NVMOP" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BFSWAP" edc:mask="0x1" edc:name="BFSWAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFSWAP" edc:desc="" edc:mask="0x1" edc:name="PFSWAP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LVDERR" edc:desc="" edc:mask="0x1" edc:name="LVDERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="NVMOP0" edc:desc="" edc:mask="0x1" edc:name="NVMOP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMOP1" edc:desc="" edc:mask="0x1" edc:name="NVMOP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMOP2" edc:desc="" edc:mask="0x1" edc:name="NVMOP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMOP3" edc:desc="" edc:mask="0x1" edc:name="NVMOP3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:mask="0x1" edc:name="SWAP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="PROGOP" edc:desc="" edc:mask="0x1" edc:name="PROGOP" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="PROGOP0" edc:desc="" edc:mask="0x1" edc:name="PROGOP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGOP1" edc:desc="" edc:mask="0x1" edc:name="PROGOP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGOP2" edc:desc="" edc:mask="0x1" edc:name="PROGOP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGOP3" edc:desc="" edc:mask="0x1" edc:name="PROGOP3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMKEY" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb0" edc:_addr="0x1F800A10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMKEY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMADDR" edc:desc="" edc:grp="NVM" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb0" edc:_addr="0x1F800A20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
