Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="------------------------rrr----r" edc:cname="DMTSTAT" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000----0" edc:name="DMTSTAT" edc:nzwidth="32" edc:por="------------------------000----0" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F800E30">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WINOPN" edc:desc="" edc:mask="0x1" edc:name="WINOPN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMTEVENT" edc:desc="" edc:mask="0x1" edc:name="DMTEVENT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD" edc:desc="" edc:mask="0x3" edc:name="BAD" edc:nzwidth="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="BAD2" edc:desc="" edc:mask="0x1" edc:name="BAD2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD1" edc:desc="" edc:mask="0x1" edc:name="BAD1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTCNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DMTCNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F800E40">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="" edc:mask="0xffffffff" edc:name="COUNTER" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F800E50"/>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTPSCNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DMTPSCNT" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="2" edc:_begin="0x60" edc:_end="0x80" edc:_addr="0x1F800E60">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xffffffff" edc:name="PSCNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTPSINTV" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DMTPSINTV" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="2" edc:_begin="0x60" edc:_end="0x80" edc:_addr="0x1F800E70">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PSINTV" edc:desc="" edc:mask="0xffffffff" edc:name="PSINTV" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x180" edc:_addr="0x1F800E80"/>
      <edc:SFRDef edc:access="-----------------n-------nnnnnnn" edc:cname="_ICDCON" edc:desc="" edc:impl="0x407f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------0-------0000000" edc:name="_ICDCON" edc:nzwidth="32" edc:por="-----------------0-------0000000" edc:portals="- - -" edc:_modsrc="DOS-02869_icd_jtag_bvci_upb_v2.Module" edc:_refcount="1" edc:_begin="0x130" edc:_end="0x150" edc:_addr="0x1F801000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKSWBKEN" edc:desc="" edc:mask="0x1" edc:name="CKSWBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPBKEN" edc:desc="" edc:mask="0x1" edc:name="SLPBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTBKEN" edc:desc="" edc:mask="0x1" edc:name="WDTBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTEN" edc:desc="" edc:mask="0x1" edc:name="WDTEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RSTBUG" edc:desc="" edc:mask="0x1" edc:name="RSTBUG" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTBKEN" edc:desc="" edc:mask="0x1" edc:name="DMTBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTEN" edc:desc="" edc:mask="0x1" edc:name="DMTEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------nnnnnn" edc:cname="_ICDSTAT" edc:desc="" edc:grp="_DDPSTAT" edc:impl="0xf9ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="_ICDSTAT" edc:nzwidth="0x20" edc:por="--------------------------000000" edc:portals="- - -" ltx:baseofperipheral="_DDPSTAT" edc:_modsrc="DOS-02869_icd_jtag_bvci_upb_v2.Module" edc:_refcount="1" edc:_begin="0x130" edc:_end="0x150" edc:_addr="0x1F801010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKSWBF" edc:desc="" edc:mask="0x1" edc:name="CKSWBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPBF" edc:desc="" edc:mask="0x1" edc:name="SLPBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTBF" edc:desc="" edc:mask="0x1" edc:name="WDTBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMTBF" edc:desc="" edc:mask="0x1" edc:name="DMTBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTRUNBF" edc:mask="0x1" edc:name="WDTRUNBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTSLPBF" edc:mask="0x1" edc:name="WDTSLPBF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:AdjustPoint edc:offset="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1e0" edc:_addr="0x1F801020"/>
      <edc:SFRDef edc:access="-----nnnn-n------rrr-nnnn--nnnnn" edc:cname="OSCCON" edc:desc="" edc:impl="0x7a0779f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0000-u------000-xxx0--000x0" edc:name="OSCCON" edc:nzwidth="32" edc:por="-----0000-x------000-xxx0--000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F801200">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UFRCEN" edc:desc="" edc:mask="0x1" edc:name="UFRCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x7" edc:name="COSC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SLP2SPD" edc:mask="0x1" edc:name="SLP2SPD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRMEN" edc:desc="" edc:mask="0x1" edc:name="DRMEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRCDIV" edc:desc="" edc:mask="0x7" edc:name="FRCDIV" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
