Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="------------------------nnnn---n" edc:cname="PWRCON" edc:desc="" edc:impl="0xf1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------uuuu---0" edc:name="PWRCON" edc:nzwidth="32" edc:por="------------------------xxxx---0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACN_clk_cru_upb_v2.Module" edc:_refcount="1" edc:_begin="0x50" edc:_end="0x90" edc:_addr="0x1F801270">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREGSLP" edc:mask="0x3" edc:name="VREGSLP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRUN" edc:mask="0x3" edc:name="VREGRUN" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO1CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO1CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="2" edc:_begin="0x90" edc:_end="0xb0" edc:_addr="0x1F801280">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnn-----------------------" edc:cname="REFO1TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO1TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="2" edc:_begin="0x90" edc:_end="0xb0" edc:_addr="0x1F801290">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO2CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO2CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="3" edc:_begin="0x90" edc:_end="0xb0" edc:_addr="0x1F8012A0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK2" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnn-----------------------" edc:cname="REFO2TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO2TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="3" edc:_begin="0x90" edc:_end="0xb0" edc:_addr="0x1F8012B0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO3CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO3CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="4" edc:_begin="0x90" edc:_end="0xb0" edc:_addr="0x1F8012C0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK3" edc:pos="14"/>
      </edc:SFRDef>
