Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="U6RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U6RXR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="34" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80148C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6RXR" edc:desc="" edc:mask="0xf" edc:name="U6RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="U6CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U6CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="35" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801490">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6CTSR" edc:desc="" edc:mask="0xf" edc:name="U6CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="04" edc:_addr="0x1F801494"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SDI1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI1R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="36" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801498">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0xf" edc:name="SDI1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SS1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS1R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="37" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80149C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0xf" edc:name="SS1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="04" edc:_addr="0x1F8014A0"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SDI2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="38" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0xf" edc:name="SDI2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SS2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="39" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS2R" edc:desc="" edc:mask="0xf" edc:name="SS2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SCK3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SCK3R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="40" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCK3R" edc:desc="" edc:mask="0xf" edc:name="SCK3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SDI3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI3R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="41" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI3R" edc:desc="" edc:mask="0xf" edc:name="SDI3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SS3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS3R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="42" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS3R" edc:desc="" edc:mask="0xf" edc:name="SS3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SCK4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SCK4R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="43" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCK4R" edc:desc="" edc:mask="0xf" edc:name="SCK4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
