Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IPTMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IPTMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810030">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IPTMR" edc:desc="" edc:mask="0xffffffff" edc:name="IPTMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0xcfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="IFS0" edc:nzwidth="32" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810040">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIF" edc:desc="" edc:mask="0x1" edc:name="IC5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IF" edc:desc="" edc:mask="0x1" edc:name="IC5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IF" edc:desc="" edc:mask="0x1" edc:name="OC5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xcfffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xffffdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810050">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USB1IF" edc:desc="" edc:mask="0x1" edc:name="USB1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIF" edc:desc="" edc:mask="0x1" edc:name="CNEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIF" edc:desc="" edc:mask="0x1" edc:name="CNFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIF" edc:desc="" edc:mask="0x1" edc:name="CNGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPIF" edc:desc="" edc:mask="0x1" edc:name="PMPIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPEIF" edc:mask="0x1" edc:name="PMPEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:desc="" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:desc="" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
