Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="nnnnnnnnn---nnnnnnnnn-----nnnnnn" edc:cname="IEC4" edc:desc="" edc:impl="0xff8ff83f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---000000000-----000000" edc:name="IEC4" edc:nzwidth="32" edc:por="000000000---000000000-----000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810100">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D22IE" edc:desc="" edc:mask="0x1" edc:name="AD1D22IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D23IE" edc:desc="" edc:mask="0x1" edc:name="AD1D23IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D24IE" edc:desc="" edc:mask="0x1" edc:name="AD1D24IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D25IE" edc:desc="" edc:mask="0x1" edc:name="AD1D25IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D26IE" edc:desc="" edc:mask="0x1" edc:name="AD1D21IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D27IE" edc:desc="" edc:mask="0x1" edc:name="AD1D27IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="AD1D33IE" edc:desc="" edc:mask="0x1" edc:name="AD1D33IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D34IE" edc:desc="" edc:mask="0x1" edc:name="AD1D34IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D35IE" edc:desc="" edc:mask="0x1" edc:name="AD1D35IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D36IE" edc:desc="" edc:mask="0x1" edc:name="AD1D36IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D37IE" edc:desc="" edc:mask="0x1" edc:name="AD1D37IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D38IE" edc:desc="" edc:mask="0x1" edc:name="AD1D38IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D39IE" edc:desc="" edc:mask="0x1" edc:name="AD1D39IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D40IE" edc:desc="" edc:mask="0x1" edc:name="AD1D40IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D41IE" edc:desc="" edc:mask="0x1" edc:name="AD1D41IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D45IE" edc:desc="" edc:mask="0x1" edc:name="AD1D45IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D46IE" edc:desc="" edc:mask="0x1" edc:name="AD1D46IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D47IE" edc:desc="" edc:mask="0x1" edc:name="AD1D47IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D48IE" edc:desc="" edc:mask="0x1" edc:name="AD1D48IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D49IE" edc:desc="" edc:mask="0x1" edc:name="AD1D49IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D50IE" edc:desc="" edc:mask="0x1" edc:name="AD1D50IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D51IE" edc:desc="" edc:mask="0x1" edc:name="AD1D51IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D52IE" edc:desc="" edc:mask="0x1" edc:name="AD1D52IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D53IE" edc:desc="" edc:mask="0x1" edc:name="AD1D53IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="IEC5" edc:desc="" edc:impl="0xfffffff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu0000000000uuuuuuuuuu00000-000" edc:name="IEC5" edc:nzwidth="32" edc:por="xxx0000000000xxxxxxxxxx00000-000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810110">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IE" edc:desc="" edc:mask="0x1" edc:name="CMP3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP4IE" edc:desc="" edc:mask="0x1" edc:name="CMP4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP5IE" edc:desc="" edc:mask="0x1" edc:name="CMP5IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U6EIE" edc:desc="" edc:mask="0x1" edc:name="U6EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIE" edc:desc="" edc:mask="0x1" edc:name="U6RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIE" edc:desc="" edc:mask="0x1" edc:name="U6TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN1IE" edc:desc="" edc:mask="0x1" edc:name="CAN1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2IE" edc:desc="" edc:mask="0x1" edc:name="CAN2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="QEI1IE" edc:mask="0x1" edc:name="QEI1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI2IE" edc:mask="0x1" edc:name="QEI2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMPEVTIE" edc:mask="0x1" edc:name="PWMPEVTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMSEVTIE" edc:mask="0x1" edc:name="PWMSEVTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM1IE" edc:mask="0x1" edc:name="PWM1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM2IE" edc:mask="0x1" edc:name="PWM2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM3IE" edc:mask="0x1" edc:name="PWM3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM4IE" edc:mask="0x1" edc:name="PWM4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM5IE" edc:mask="0x1" edc:name="PWM5IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM6IE" edc:mask="0x1" edc:name="PWM6IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3BIE" edc:desc="" edc:mask="0x1" edc:name="I2C3BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIE" edc:desc="" edc:mask="0x1" edc:name="I2C3SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIE" edc:desc="" edc:mask="0x1" edc:name="I2C3MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IE" edc:desc="" edc:mask="0x1" edc:name="DMA4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IE" edc:desc="" edc:mask="0x1" edc:name="DMA5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IE" edc:desc="" edc:mask="0x1" edc:name="DMA6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IE" edc:desc="" edc:mask="0x1" edc:name="DMA7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATAEEIE" edc:desc="" edc:mask="0x1" edc:name="DATAEEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN3IE" edc:desc="" edc:mask="0x1" edc:name="CAN3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN4IE" edc:desc="" edc:mask="0x1" edc:name="CAN4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="QEI3IE" edc:mask="0x1" edc:name="QEI3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI4IE" edc:mask="0x1" edc:name="QEI4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI5IE" edc:mask="0x1" edc:name="QEI5IE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
