Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC13" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC13" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810210">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMPEIS" edc:desc="" edc:mask="0x3" edc:name="PMPEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PMPEIP" edc:desc="" edc:mask="0x7" edc:name="PMPEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2EIS" edc:desc="" edc:mask="0x3" edc:name="SPI2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2EIP" edc:desc="" edc:mask="0x7" edc:name="SPI2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC14" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC14" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810220">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2EIS" edc:desc="" edc:mask="0x3" edc:name="U2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2EIP" edc:desc="" edc:mask="0x7" edc:name="U2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2RXIS" edc:desc="" edc:mask="0x3" edc:name="U2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2RXIP" edc:desc="" edc:mask="0x7" edc:name="U2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2TXIS" edc:desc="" edc:mask="0x3" edc:name="U2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2TXIP" edc:desc="" edc:mask="0x7" edc:name="U2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2BIS" edc:desc="" edc:mask="0x3" edc:name="I2C2BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2BIP" edc:desc="" edc:mask="0x7" edc:name="I2C2BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC15" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC15" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810230">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C2SIS" edc:desc="" edc:mask="0x3" edc:name="I2C2SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2SIP" edc:desc="" edc:mask="0x7" edc:name="I2C2SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2MIS" edc:desc="" edc:mask="0x3" edc:name="I2C2MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2MIP" edc:desc="" edc:mask="0x7" edc:name="I2C2MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U3EIS" edc:desc="" edc:mask="0x3" edc:name="U3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3EIP" edc:desc="" edc:mask="0x7" edc:name="U3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U3RXIS" edc:desc="" edc:mask="0x3" edc:name="U3RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3RXIP" edc:desc="" edc:mask="0x7" edc:name="U3RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC16" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC16" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810240">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIS" edc:desc="" edc:mask="0x3" edc:name="U3TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3TXIP" edc:desc="" edc:mask="0x7" edc:name="U3TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U4EIS" edc:desc="" edc:mask="0x3" edc:name="U4EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U4EIP" edc:desc="" edc:mask="0x7" edc:name="U4EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U4RXIS" edc:desc="" edc:mask="0x3" edc:name="U4RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U4RXIP" edc:desc="" edc:mask="0x7" edc:name="U4RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U4TXIS" edc:desc="" edc:mask="0x3" edc:name="U4TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U4TXIP" edc:desc="" edc:mask="0x7" edc:name="U4TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC17" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC17" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810250">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U5EIS" edc:desc="" edc:mask="0x3" edc:name="U5EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U5EIP" edc:desc="" edc:mask="0x7" edc:name="U5EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U5RXIS" edc:desc="" edc:mask="0x3" edc:name="U5RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U5RXIP" edc:desc="" edc:mask="0x7" edc:name="U5RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U5TXIS" edc:desc="" edc:mask="0x3" edc:name="U5TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U5TXIP" edc:desc="" edc:mask="0x7" edc:name="U5TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CTMUIS" edc:desc="" edc:mask="0x3" edc:name="CTMUIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTMUIP" edc:desc="" edc:mask="0x7" edc:name="CTMUIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC18" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC18" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810260">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA0IS" edc:desc="" edc:mask="0x3" edc:name="DMA0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA0IP" edc:desc="" edc:mask="0x7" edc:name="DMA0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA1IS" edc:desc="" edc:mask="0x3" edc:name="DMA1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA1IP" edc:desc="" edc:mask="0x7" edc:name="DMA1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA2IS" edc:desc="" edc:mask="0x3" edc:name="DMA2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA2IP" edc:desc="" edc:mask="0x7" edc:name="DMA2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA3IS" edc:desc="" edc:mask="0x3" edc:name="DMA3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA3IP" edc:desc="" edc:mask="0x7" edc:name="DMA3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC19" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC19" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810270">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T6IS" edc:desc="" edc:mask="0x3" edc:name="T6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T6IP" edc:desc="" edc:mask="0x7" edc:name="T6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC6EIS" edc:desc="" edc:mask="0x3" edc:name="IC6EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC6EIP" edc:desc="" edc:mask="0x7" edc:name="IC6EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC6IS" edc:desc="" edc:mask="0x3" edc:name="IC6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC6IP" edc:desc="" edc:mask="0x7" edc:name="IC6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC6IS" edc:desc="" edc:mask="0x3" edc:name="OC6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC6IP" edc:desc="" edc:mask="0x7" edc:name="OC6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC20" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC20" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810280">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7IS" edc:desc="" edc:mask="0x3" edc:name="T7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T7IP" edc:desc="" edc:mask="0x7" edc:name="T7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC7EIS" edc:desc="" edc:mask="0x3" edc:name="IC7EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC7EIP" edc:desc="" edc:mask="0x7" edc:name="IC7EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC7IS" edc:desc="" edc:mask="0x3" edc:name="IC7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC7IP" edc:desc="" edc:mask="0x7" edc:name="IC7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC7IS" edc:desc="" edc:mask="0x3" edc:name="OC7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC7IP" edc:desc="" edc:mask="0x7" edc:name="OC7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
