Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC21" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC21" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810290">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T8IS" edc:desc="" edc:mask="0x3" edc:name="T8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T8IP" edc:desc="" edc:mask="0x7" edc:name="T8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC8EIS" edc:desc="" edc:mask="0x3" edc:name="IC8EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC8EIP" edc:desc="" edc:mask="0x7" edc:name="IC8EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC8IS" edc:desc="" edc:mask="0x3" edc:name="IC8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC8IP" edc:desc="" edc:mask="0x7" edc:name="IC8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC8IS" edc:desc="" edc:mask="0x3" edc:name="OC8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC8IP" edc:desc="" edc:mask="0x7" edc:name="OC8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC22" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC22" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102A0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T9IS" edc:desc="" edc:mask="0x3" edc:name="T9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T9IP" edc:desc="" edc:mask="0x7" edc:name="T9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC9EIS" edc:desc="" edc:mask="0x3" edc:name="IC9EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC9EIP" edc:desc="" edc:mask="0x7" edc:name="IC9EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC9IS" edc:desc="" edc:mask="0x3" edc:name="IC9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC9IP" edc:desc="" edc:mask="0x7" edc:name="IC9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC9IS" edc:desc="" edc:mask="0x3" edc:name="OC9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC9IP" edc:desc="" edc:mask="0x7" edc:name="OC9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC23" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000-----------00000" edc:name="IPC23" edc:nzwidth="32" edc:por="---00000---00000-----------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102B0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1IS" edc:desc="" edc:mask="0x3" edc:name="AD1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1IP" edc:desc="" edc:mask="0x7" edc:name="AD1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC24" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC24" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102C0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF1IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DF3IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF3IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DF4IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF4IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC25" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC25" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102D0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1F1IS" edc:desc="" edc:mask="0x3" edc:name="AD1F1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1F1IP" edc:desc="" edc:mask="0x7" edc:name="AD1F1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIS" edc:desc="" edc:mask="0x3" edc:name="AD1EOSIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIP" edc:desc="" edc:mask="0x7" edc:name="AD1EOSIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1ARIS" edc:desc="" edc:mask="0x3" edc:name="AD1ARIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1ARIP" edc:desc="" edc:mask="0x7" edc:name="AD1ARIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1RSIS" edc:desc="" edc:mask="0x3" edc:name="AD1RSIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1RSIP" edc:desc="" edc:mask="0x7" edc:name="AD1RSIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC26" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC26" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1FCBTIS" edc:desc="" edc:mask="0x3" edc:name="AD1FCBTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1FCBTIP" edc:desc="" edc:mask="0x7" edc:name="AD1FCBTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1G1IS" edc:desc="" edc:mask="0x3" edc:name="AD1G1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1G1IP" edc:desc="" edc:mask="0x7" edc:name="AD1G1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D0IS" edc:desc="" edc:mask="0x3" edc:name="AD1D0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D0IP" edc:desc="" edc:mask="0x7" edc:name="AD1D0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D1IS" edc:desc="" edc:mask="0x3" edc:name="AD1D1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D1IP" edc:desc="" edc:mask="0x7" edc:name="AD1D1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC27" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC27" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D2IS" edc:desc="" edc:mask="0x3" edc:name="AD1D2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D2IP" edc:desc="" edc:mask="0x7" edc:name="AD1D2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D3IS" edc:desc="" edc:mask="0x3" edc:name="AD1D3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D3IP" edc:desc="" edc:mask="0x7" edc:name="AD1D3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D4IS" edc:desc="" edc:mask="0x3" edc:name="AD1D4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D4IP" edc:desc="" edc:mask="0x7" edc:name="AD1D4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D5IS" edc:desc="" edc:mask="0x3" edc:name="AD1D5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D5IP" edc:desc="" edc:mask="0x7" edc:name="AD1D5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC28" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC28" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810300">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D6IS" edc:desc="" edc:mask="0x3" edc:name="AD1D6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D6IP" edc:desc="" edc:mask="0x7" edc:name="AD1D6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D7IS" edc:desc="" edc:mask="0x3" edc:name="AD1D7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D7IP" edc:desc="" edc:mask="0x7" edc:name="AD1D7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D8IS" edc:desc="" edc:mask="0x3" edc:name="AD1D8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D8IP" edc:desc="" edc:mask="0x7" edc:name="AD1D8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D9IS" edc:desc="" edc:mask="0x3" edc:name="AD1D9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D9IP" edc:desc="" edc:mask="0x7" edc:name="AD1D9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC29" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC29" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810310">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D10IS" edc:desc="" edc:mask="0x3" edc:name="AD1D10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D10IP" edc:desc="" edc:mask="0x7" edc:name="AD1D10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D11IS" edc:desc="" edc:mask="0x3" edc:name="AD1D11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D11IP" edc:desc="" edc:mask="0x7" edc:name="AD1D11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D12IS" edc:desc="" edc:mask="0x3" edc:name="AD1D12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D12IP" edc:desc="" edc:mask="0x7" edc:name="AD1D12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D13IS" edc:desc="" edc:mask="0x3" edc:name="AD1D13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D13IP" edc:desc="" edc:mask="0x7" edc:name="AD1D13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC30" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC30" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810320">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D14IS" edc:desc="" edc:mask="0x3" edc:name="AD1D14IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D14IP" edc:desc="" edc:mask="0x7" edc:name="AD1D14IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D15IS" edc:desc="" edc:mask="0x3" edc:name="AD1D15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D15IP" edc:desc="" edc:mask="0x7" edc:name="AD1D15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D16IS" edc:desc="" edc:mask="0x3" edc:name="AD1D16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D16IP" edc:desc="" edc:mask="0x7" edc:name="AD1D16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D17IS" edc:desc="" edc:mask="0x3" edc:name="AD1D17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D17IP" edc:desc="" edc:mask="0x7" edc:name="AD1D17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC31" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC31" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810330">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D18IS" edc:desc="" edc:mask="0x3" edc:name="AD1D18IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D18IP" edc:desc="" edc:mask="0x7" edc:name="AD1D18IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D19IS" edc:desc="" edc:mask="0x3" edc:name="AD1D19IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D19IP" edc:desc="" edc:mask="0x7" edc:name="AD1D19IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D20IS" edc:desc="" edc:mask="0x3" edc:name="AD1D20IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D20IP" edc:desc="" edc:mask="0x7" edc:name="AD1D20IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D21IS" edc:desc="" edc:mask="0x3" edc:name="AD1D21IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D21IP" edc:desc="" edc:mask="0x7" edc:name="AD1D21IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC32" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC32" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810340">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D22IS" edc:desc="" edc:mask="0x3" edc:name="AD1D22IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D22IP" edc:desc="" edc:mask="0x7" edc:name="AD1D22IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D23IS" edc:desc="" edc:mask="0x3" edc:name="AD1D23IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D23IP" edc:desc="" edc:mask="0x7" edc:name="AD1D23IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D24IS" edc:desc="" edc:mask="0x3" edc:name="AD1D24IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D24IP" edc:desc="" edc:mask="0x7" edc:name="AD1D24IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D25IS" edc:desc="" edc:mask="0x3" edc:name="AD1D25IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D25IP" edc:desc="" edc:mask="0x7" edc:name="AD1D25IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC33" edc:impl="0xe0e0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC33" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810350">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D26IS" edc:desc="" edc:mask="0x3" edc:name="AD1D26IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D26IP" edc:desc="" edc:mask="0x7" edc:name="AD1D26IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D27IS" edc:desc="" edc:mask="0x3" edc:name="AD1D27IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D27IP" edc:desc="" edc:mask="0x7" edc:name="AD1D27IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="13"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
