Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC56" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC56" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8104C0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI5EIS" edc:desc="" edc:mask="0x3" edc:name="SPI5EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5EIP" edc:desc="" edc:mask="0x7" edc:name="SPI5EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6EIS" edc:desc="" edc:mask="0x3" edc:name="SPI6EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6EIP" edc:desc="" edc:mask="0x7" edc:name="SPI6EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="IPC57" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="IPC57" edc:nzwidth="32" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8104D0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI6RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI6RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI6RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI6TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI6TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SBIS" edc:desc="" edc:mask="0x3" edc:name="SBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SBIP" edc:desc="" edc:mask="0x7" edc:name="SBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------------" edc:cname="IPC58" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="IPC58" edc:nzwidth="32" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8104E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC59" edc:impl="0xffffe0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu----------------" edc:name="IPC59" edc:nzwidth="32" edc:por="---xxxxx---xxxxx----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8104F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="PWM7IS" edc:mask="0x3" edc:name="PWM7IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM7IP" edc:mask="0x7" edc:name="PWM7IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM8IS" edc:mask="0x3" edc:name="PWM8IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM8IP" edc:mask="0x7" edc:name="PWM8IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="IPC60" edc:impl="0xe0e0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="IPC60" edc:nzwidth="32" edc:por="---------------------------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810500">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWM9IS" edc:mask="0x3" edc:name="PWM9IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM9IP" edc:mask="0x7" edc:name="PWM9IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xe0e0e0ff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC61" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---00000---00000---00000" edc:name="IPC61" edc:nzwidth="32" edc:por="---xxxxx---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810510">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USB2IS" edc:desc="" edc:mask="0x3" edc:name="USB2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USB2IP" edc:desc="" edc:mask="0x7" edc:name="USB2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PCACHEIS" edc:desc="PCACHE Interrupt Sub-Priority" edc:mask="0x3" edc:name="PCACHEIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PCACHEIP" edc:desc="PCACHE Interrupt Priority" edc:mask="0x7" edc:name="PCACHEIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------------" edc:cname="IPC62" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="IPC62" edc:nzwidth="32" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810520">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
