Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF181" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF181" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810814">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF182" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF182" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810818">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF183" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF183" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81081C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF184" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF184" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810820">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF185" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF185" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810824">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF186" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF186" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810828">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF187" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF187" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81082C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF188" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF188" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810830">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF189" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF189" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810834">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF190" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF190" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810838">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF191" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF191" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81083C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF192" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF192" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810840">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810844"/>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF194" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF194" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810848">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF195" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF195" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81084C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF196" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF196" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810850">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF197" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF197" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACK_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810854">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
