Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:AdjustPoint edc:offset="0x0ff0" edc:_addr="0x1F82D010"/>
      <edc:SFRDef edc:access="--------n-----nnn-nnnnnnnnnnn-nn" edc:cname="PMCON" edc:desc="" edc:grp="PMP" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------x-----xx00000-0000000-00" edc:name="PMCON" edc:nzwidth="0x20" edc:por="--------x-----xx00000-0000000-00" edc:portals="CLR SET INV" ltx:baseofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RDSP" edc:desc="" edc:mask="0x1" edc:name="RDSP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRSP" edc:desc="" edc:mask="0x1" edc:name="WRSP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CS1P" edc:desc="" edc:mask="0x1" edc:name="CS1P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS2P" edc:desc="" edc:mask="0x1" edc:name="CS2P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALP" edc:desc="" edc:mask="0x1" edc:name="ALP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSF" edc:desc="" edc:mask="0x3" edc:name="CSF" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTRDEN" edc:desc="" edc:mask="0x1" edc:name="PTRDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTWREN" edc:desc="" edc:mask="0x1" edc:name="PTWREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPTTL" edc:desc="" edc:mask="0x1" edc:name="PMPTTL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADRMUX" edc:desc="" edc:mask="0x3" edc:name="ADRMUX" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXADR" edc:desc="" edc:mask="0x1" edc:name="EXADR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DUALBUF" edc:desc="" edc:mask="0x1" edc:name="DUALBUF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RDSTART" edc:desc="" edc:mask="0x1" edc:name="RDSTART" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CSF0" edc:desc="" edc:mask="0x1" edc:name="CSF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSF1" edc:desc="" edc:mask="0x1" edc:name="CSF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADRMUX0" edc:desc="" edc:mask="0x1" edc:name="ADRMUX0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADRMUX1" edc:desc="" edc:mask="0x1" edc:name="ADRMUX1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="PSIDL" edc:desc="" edc:mask="0x1" edc:name="PSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPEN" edc:desc="" edc:mask="0x1" edc:name="PMPEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="PARALLEL MASTER/SLAVE PORT" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMMODE" edc:desc="" edc:grp="PMP" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00000-0000000000" edc:name="PMMODE" edc:nzwidth="0x20" edc:por="----------------00000-0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WAITE" edc:desc="" edc:mask="0x3" edc:name="WAITE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="WAITM" edc:desc="" edc:mask="0xf" edc:name="WAITM" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="WAITB" edc:desc="" edc:mask="0x3" edc:name="WAITB" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="MODE16" edc:desc="" edc:mask="0x1" edc:name="MODE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INCM" edc:desc="" edc:mask="0x3" edc:name="INCM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IRQM" edc:desc="" edc:mask="0x3" edc:name="IRQM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="WAITE0" edc:desc="" edc:mask="0x1" edc:name="WAITE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITE1" edc:desc="" edc:mask="0x1" edc:name="WAITE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITM0" edc:desc="" edc:mask="0x1" edc:name="WAITM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITM1" edc:desc="" edc:mask="0x1" edc:name="WAITM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITM2" edc:desc="" edc:mask="0x1" edc:name="WAITM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITM3" edc:desc="" edc:mask="0x1" edc:name="WAITM3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITB0" edc:desc="" edc:mask="0x1" edc:name="WAITB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITB1" edc:desc="" edc:mask="0x1" edc:name="WAITB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INCM0" edc:desc="" edc:mask="0x1" edc:name="INCM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INCM1" edc:desc="" edc:mask="0x1" edc:name="INCM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRQM0" edc:desc="" edc:mask="0x1" edc:name="IRQM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRQM1" edc:desc="" edc:mask="0x1" edc:name="IRQM1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMADDR" edc:desc="" edc:grp="PMP" edc:impl="0xff00ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PMADDR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="" edc:mask="0x3fff" edc:name="ADDR" edc:nzwidth="14"/>
            <edc:SFRFieldDef edc:cname="ADDR14" edc:desc="" edc:mask="0x1" edc:name="ADDR14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADDR15" edc:desc="" edc:mask="0x1" edc:name="ADDR15" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="14"/>
            <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMDOUT" edc:desc="" edc:grp="PMP" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PMDOUT" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATAOUT" edc:desc="" edc:mask="0xffffffff" edc:name="DATAOUT" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMDIN" edc:desc="" edc:grp="PMP" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PMDIN" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATAIN" edc:desc="" edc:mask="0xffffffff" edc:name="DATAIN" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMAEN" edc:desc="" edc:grp="PMP" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------xxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PMAEN" edc:nzwidth="0x20" edc:por="--------xxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E050">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTEN" edc:desc="" edc:mask="0xffffff" edc:name="PTEN" edc:nzwidth="24"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------rn--rrrrrn--rrrr" edc:cname="PMSTAT" edc:desc="" edc:grp="PMP" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00--000010--1111" edc:name="PMSTAT" edc:nzwidth="0x20" edc:por="----------------00--000010--1111" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OB0E" edc:desc="" edc:mask="0x1" edc:name="OB0E" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OB1E" edc:desc="" edc:mask="0x1" edc:name="OB1E" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OB2E" edc:desc="" edc:mask="0x1" edc:name="OB2E" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OB3E" edc:desc="" edc:mask="0x1" edc:name="OB3E" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OBUF" edc:desc="" edc:mask="0x1" edc:name="OBUF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OBE" edc:desc="" edc:mask="0x1" edc:name="OBE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IB0F" edc:desc="" edc:mask="0x1" edc:name="IB0F" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IB1F" edc:desc="" edc:mask="0x1" edc:name="IB1F" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IB2F" edc:desc="" edc:mask="0x1" edc:name="IB2F" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IB3F" edc:desc="" edc:mask="0x1" edc:name="IB3F" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="IBOV" edc:desc="" edc:mask="0x1" edc:name="IBOV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IBF" edc:desc="" edc:mask="0x1" edc:name="IBF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMWADDR" edc:desc="" edc:grp="PMP" edc:impl="0xfcffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuxxxxxxxxxxxxxxxxxxxxxx" edc:name="PMWADDR" edc:nzwidth="0x20" edc:por="--------xxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WADDR" edc:desc="" edc:mask="0xffffff" edc:name="WADDR" edc:nzwidth="24"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="14"/>
            <edc:SFRFieldDef edc:cname="WCS" edc:desc="" edc:mask="0x3" edc:name="WCS" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="WCSA" edc:mask="0x3" edc:name="WCSA" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="WCS1" edc:desc="" edc:mask="0x1" edc:name="WCS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCS2" edc:desc="" edc:mask="0x1" edc:name="WCS2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="WCS1A" edc:mask="0x1" edc:name="WCS1A" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCS2A" edc:mask="0x1" edc:name="WCS2A" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="WADDR14" edc:desc="" edc:mask="0x1" edc:name="WADDR14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WADDR15" edc:desc="" edc:mask="0x1" edc:name="WADDR15" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WADDR22" edc:mask="0x1" edc:name="WADDR22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WADDR23" edc:mask="0x1" edc:name="WADDR23" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMRADDR" edc:desc="" edc:grp="PMP" edc:impl="0xff00ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PMRADDR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82E080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RADDR" edc:desc="" edc:mask="0x3fff" edc:name="RADDR" edc:nzwidth="14"/>
            <edc:SFRFieldDef edc:cname="RADDR14" edc:desc="" edc:mask="0x1" edc:name="RADDR14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RADDR15" edc:desc="" edc:mask="0x1" edc:name="RADDR15" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="14"/>
            <edc:SFRFieldDef edc:cname="RCS" edc:desc="" edc:mask="0x3" edc:name="RCS" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="RCS1" edc:desc="" edc:mask="0x1" edc:name="RCS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCS2" edc:desc="" edc:mask="0x1" edc:name="RCS2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
