Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:AdjustPoint edc:offset="0x1f0" edc:_addr="0x1F84C410"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnn------n------nn" edc:cname="DAC3CON" edc:desc="CDAC Control Register" edc:impl="0xffff8103" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000------0------00" edc:name="DAC3CON" edc:nzwidth="32" edc:por="00000000000000000------0------00" edc:portals="CLR SET INV" ltx:baseofperipheral="CDAC3" edc:_modsrc="DOS-01445_dac_nbit__control_upb_v1_32bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1F84C600">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Source Select" edc:mask="0x3" edc:name="REFSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="No Reference Selected (no current consumed)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = External Vref+ Pin" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = 2 * Internal Bandgap Reference Voltage" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = AVdd" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DACOE" edc:desc="CDAC Output Enable" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Output is Disabled; drive to pin is floating" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Output is Enabled; CDAC voltage is connected to the pin." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="CDAC Enable" edc:mask="0x1" edc:name="ON" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The CDAC is Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="The CDAC is Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DACDAT" edc:desc="Data Input Register Bits for the CDAC" edc:mask="0xffff" edc:name="DACDAT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f860000" edc:endaddr="0x1f860700" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb4_std">
      <edc:SFRDef edc:access="-------------------nn--n---n--nn" edc:cname="ANSELA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1913" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------11--1---1--11" edc:name="ANSELA" edc:nzwidth="0x20" edc:por="-------------------11--1---1--11" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA8" edc:desc="" edc:mask="0x1" edc:name="ANSA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA11" edc:desc="" edc:mask="0x1" edc:name="ANSA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA12" edc:desc="" edc:mask="0x1" edc:name="ANSA12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnn-nn--n--nn" edc:cname="TRISA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------111-11--1--11" edc:name="TRISA" edc:nzwidth="0x20" edc:por="-------------------111-11--1--11" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA8" edc:desc="" edc:mask="0x1" edc:name="TRISA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA10" edc:desc="" edc:mask="0x1" edc:name="TRISA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA11" edc:desc="" edc:mask="0x1" edc:name="TRISA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA12" edc:desc="" edc:mask="0x1" edc:name="TRISA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnn-nn--n--nn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------xxx-xx--x--xx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="-------------------xxx-xx--x--xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA8" edc:desc="" edc:mask="0x1" edc:name="RA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA11" edc:desc="" edc:mask="0x1" edc:name="RA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA12" edc:desc="" edc:mask="0x1" edc:name="RA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
