Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="-------------------nnn-nn--n--nn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------xxx-xx--x--xx" edc:name="LATA" edc:nzwidth="0x20" edc:por="-------------------xxx-xx--x--xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA8" edc:desc="" edc:mask="0x1" edc:name="LATA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA11" edc:desc="" edc:mask="0x1" edc:name="LATA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA12" edc:desc="" edc:mask="0x1" edc:name="LATA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnn-nn--n--nn" edc:cname="ODCA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------000-00--0--00" edc:name="ODCA" edc:nzwidth="0x20" edc:por="-------------------000-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA7" edc:desc="" edc:mask="0x1" edc:name="ODCA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA8" edc:desc="" edc:mask="0x1" edc:name="ODCA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA10" edc:desc="" edc:mask="0x1" edc:name="ODCA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA11" edc:desc="" edc:mask="0x1" edc:name="ODCA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCA12" edc:desc="" edc:mask="0x1" edc:name="ODCA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnn-nn--n--nn" edc:cname="CNPUA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------000-00--0--00" edc:name="CNPUA" edc:nzwidth="0x20" edc:por="-------------------000-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUA0" edc:desc="" edc:mask="0x1" edc:name="CNPUA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA1" edc:desc="" edc:mask="0x1" edc:name="CNPUA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA4" edc:desc="" edc:mask="0x1" edc:name="CNPUA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA7" edc:desc="" edc:mask="0x1" edc:name="CNPUA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA8" edc:desc="" edc:mask="0x1" edc:name="CNPUA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA10" edc:desc="" edc:mask="0x1" edc:name="CNPUA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA11" edc:desc="" edc:mask="0x1" edc:name="CNPUA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA12" edc:desc="" edc:mask="0x1" edc:name="CNPUA12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
