Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="----------------n---n-----------" edc:cname="CNCONB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONB" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860170">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE B" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENB" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNENB" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEB0" edc:desc="" edc:mask="0x1" edc:name="CNIEB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB1" edc:desc="" edc:mask="0x1" edc:name="CNIEB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB2" edc:desc="" edc:mask="0x1" edc:name="CNIEB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB3" edc:desc="" edc:mask="0x1" edc:name="CNIEB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB4" edc:desc="" edc:mask="0x1" edc:name="CNIEB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB5" edc:desc="" edc:mask="0x1" edc:name="CNIEB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB6" edc:desc="" edc:mask="0x1" edc:name="CNIEB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB7" edc:desc="" edc:mask="0x1" edc:name="CNIEB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB8" edc:desc="" edc:mask="0x1" edc:name="CNIEB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB9" edc:desc="" edc:mask="0x1" edc:name="CNIEB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB10" edc:desc="" edc:mask="0x1" edc:name="CNIEB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB11" edc:desc="" edc:mask="0x1" edc:name="CNIEB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB12" edc:desc="" edc:mask="0x1" edc:name="CNIEB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB13" edc:desc="" edc:mask="0x1" edc:name="CNIEB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB14" edc:desc="" edc:mask="0x1" edc:name="CNIEB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB15" edc:desc="" edc:mask="0x1" edc:name="CNIEB15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNSTATB" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860190">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATB0" edc:desc="" edc:mask="0x1" edc:name="CNSTATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB1" edc:desc="" edc:mask="0x1" edc:name="CNSTATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB2" edc:desc="" edc:mask="0x1" edc:name="CNSTATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB3" edc:desc="" edc:mask="0x1" edc:name="CNSTATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB4" edc:desc="" edc:mask="0x1" edc:name="CNSTATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB5" edc:desc="" edc:mask="0x1" edc:name="CNSTATB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB6" edc:desc="" edc:mask="0x1" edc:name="CNSTATB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB7" edc:desc="" edc:mask="0x1" edc:name="CNSTATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB8" edc:desc="" edc:mask="0x1" edc:name="CNSTATB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB9" edc:desc="" edc:mask="0x1" edc:name="CNSTATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB10" edc:desc="" edc:mask="0x1" edc:name="CNSTATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB11" edc:desc="" edc:mask="0x1" edc:name="CNSTATB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB12" edc:desc="" edc:mask="0x1" edc:name="CNSTATB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB13" edc:desc="" edc:mask="0x1" edc:name="CNSTATB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB14" edc:desc="" edc:mask="0x1" edc:name="CNSTATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB15" edc:desc="" edc:mask="0x1" edc:name="CNSTATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
