Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="----------------------nnnn------" edc:cname="CNNEG" edc:desc="" edc:impl="0x3c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000------" edc:name="CNNEG" edc:nzwidth="32" edc:por="----------------------0000------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8606A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEG6" edc:mask="0x1" edc:name="CNNEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG7" edc:mask="0x1" edc:name="CNNEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG8" edc:mask="0x1" edc:name="CNNEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG9" edc:mask="0x1" edc:name="CNNEG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------nnnn------" edc:cname="CNFG" edc:desc="" edc:impl="0x3c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000------" edc:name="CNFG" edc:nzwidth="32" edc:por="----------------------0000------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8606B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG6" edc:mask="0x1" edc:name="CNFG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG7" edc:mask="0x1" edc:name="CNFG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG8" edc:mask="0x1" edc:name="CNFG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG9" edc:mask="0x1" edc:name="CNFG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8606C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8606D0"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f88B000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb5_std">
      <edc:SFRDef edc:access="nnnnsnnnrrrnnnnnn-nnrnnnnnnnnnnn" edc:cname="CFD1CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu01001000uuuu0-0u0uuuuuu00000" edc:name="CFD1CON" edc:nzwidth="0x20" edc:por="xxxx01001000xxxx0-0x0xxxxxx00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ISOCRCEN" edc:mask="0x1" edc:name="ISOCRCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PXEDIS" edc:mask="0x1" edc:name="PXEDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL0" edc:mask="0x1" edc:name="CLKSEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKFIL" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WFT" edc:mask="0x3" edc:name="WFT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSDIS" edc:mask="0x1" edc:name="BRSDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTXAT" edc:mask="0x1" edc:name="RTXAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESIGM" edc:mask="0x1" edc:name="ESIGM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERR2LOM" edc:mask="0x1" edc:name="SERR2LOM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STEF" edc:mask="0x1" edc:name="STEF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXQEN" edc:desc="" edc:mask="0x1" edc:name="TXQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXBWS" edc:mask="0xf" edc:name="TXBWS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CFD1NBTCFG" edc:desc="" edc:impl="0xffff7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu-uuuuuuu-uuuuuuu" edc:name="CFD1NBTCFG" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxx-xxxxxxx-xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SJW" edc:mask="0x7f" edc:name="SJW" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEG2" edc:mask="0x7f" edc:name="TSEG2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEG1" edc:mask="0xff" edc:name="TSEG1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="BRP" edc:mask="0xff" edc:name="BRP" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn---nnnnn----nnnn----nnnn" edc:cname="CFD1DBTCFG" edc:desc="" edc:impl="0xff1f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu----uuuu----uuuu" edc:name="CFD1DBTCFG" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx----xxxx----xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SJW" edc:mask="0xf" edc:name="SJW" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TSEG2" edc:mask="0xf" edc:name="TSEG2" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TSEG1" edc:mask="0x1f" edc:name="TSEG1" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BRP" edc:mask="0xff" edc:name="BRP" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nn------nn-nnnnnnn--nnnnnn" edc:cname="CFD1TDC" edc:desc="" edc:impl="0x3037f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uu------uu-uuuuuuu--uuuuuu" edc:name="CFD1TDC" edc:nzwidth="32" edc:por="------xx------xx-xxxxxxx--xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDCV" edc:mask="0x3f" edc:name="TDCV" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:mask="0x7f" edc:name="TDCO" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCMOD" edc:mask="0x3" edc:name="TDCMOD" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SID11EN" edc:mask="0x1" edc:name="SID11EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGFLTEN" edc:mask="0x1" edc:name="EDGFLTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD1TBC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD1TBC" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBC" edc:mask="0xffffffff" edc:name="TBC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------nnn------nnnnnnnnnn" edc:cname="CFD1TSCON" edc:desc="" edc:impl="0x703ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------uuu------uuuuuuuuuu" edc:name="CFD1TSCON" edc:nzwidth="32" edc:por="-------------xxx------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBCPRE" edc:mask="0x3ff" edc:name="TBCPRE" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TBCEN" edc:mask="0x1" edc:name="TBCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEOF" edc:mask="0x1" edc:name="TSEOF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSRES" edc:mask="0x1" edc:name="TSRES" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnn-nnnnnnn---rrrrr-rrrrrrr" edc:cname="CFD1VEC" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0uuuuuuu0uuuuuuu0000000001000000" edc:name="CFD1VEC" edc:nzwidth="0x20" edc:por="0xxxxxxx0xxxxxxx0000000001000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICODE" edc:desc="" edc:mask="0x7f" edc:name="ICODE" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FILHIT" edc:desc="" edc:mask="0x1f" edc:name="FILHIT" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXCODE" edc:mask="0x7f" edc:name="TXCODE" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCODE" edc:mask="0x7f" edc:name="RXCODE" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnn-----nnnnnnnnnnn-----nnnnn" edc:cname="CFD1INT" edc:desc="" edc:grp="CAN1" edc:impl="0xfcfffcff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000u--000u000000000u--000u0000" edc:name="CFD1INT" edc:nzwidth="0x20" edc:por="00000x--000x000000000x--000x0000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXIF" edc:desc="" edc:mask="0x1" edc:name="TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXIF" edc:desc="" edc:mask="0x1" edc:name="RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TBCIF" edc:desc="" edc:mask="0x1" edc:name="TBCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODIF" edc:desc="" edc:mask="0x1" edc:name="MODIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFIF" edc:mask="0x1" edc:name="TEFIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:desc="" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERRIF" edc:desc="" edc:mask="0x1" edc:name="SERRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CERRIF" edc:desc="" edc:mask="0x1" edc:name="CERRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKIF" edc:desc="" edc:mask="0x1" edc:name="WAKIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IVMIF" edc:desc="" edc:mask="0x1" edc:name="IVMIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXIE" edc:desc="" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXIE" edc:desc="" edc:mask="0x1" edc:name="RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TBCIE" edc:desc="" edc:mask="0x1" edc:name="TBCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODIE" edc:desc="" edc:mask="0x1" edc:name="MODIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFIE" edc:mask="0x1" edc:name="TEFIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:desc="" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERRIE" edc:desc="" edc:mask="0x1" edc:name="SERRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CERRIE" edc:desc="" edc:mask="0x1" edc:name="CERRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKIE" edc:desc="" edc:mask="0x1" edc:name="WAKIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IVMIE" edc:desc="" edc:mask="0x1" edc:name="IVMIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
