Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="nnnnnnnn-nnnnnnn-----nnnnnnnnnnn" edc:cname="CFD1FIFOCON31" edc:desc="" edc:impl="0xff7f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuuuuuuuuu" edc:name="CFD1FIFOCON31" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880710">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIE" edc:mask="0x1" edc:name="TFNRFNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIE" edc:mask="0x1" edc:name="TFHRFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIE" edc:mask="0x1" edc:name="TFERFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTSEN" edc:mask="0x1" edc:name="RXTSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnnnnnnnnnnnn" edc:cname="CFD1FIFOSTA31" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuuuuuuuuuu" edc:name="CFD1FIFOSTA31" edc:nzwidth="32" edc:por="-------------------xxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880720">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIF" edc:mask="0x1" edc:name="TFNRFNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIF" edc:mask="0x1" edc:name="TFHRFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIF" edc:mask="0x1" edc:name="TFERFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABT" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCI" edc:mask="0x1f" edc:name="FIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD1FIFOUA31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD1FIFOUA31" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880730">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD1FLTCON0" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD1FLTCON0" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880740">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F0BP" edc:mask="0x1f" edc:name="F0BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN0" edc:mask="0x1" edc:name="FLTEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F1BP" edc:mask="0x1f" edc:name="F1BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN1" edc:mask="0x1" edc:name="FLTEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F2BP" edc:mask="0x1f" edc:name="F2BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN2" edc:mask="0x1" edc:name="FLTEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F3BP" edc:mask="0x1f" edc:name="F3BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN3" edc:mask="0x1" edc:name="FLTEN3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD1FLTCON1" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD1FLTCON1" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880750">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F4BP" edc:mask="0x1f" edc:name="F4BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN4" edc:mask="0x1" edc:name="FLTEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F5BP" edc:mask="0x1f" edc:name="F5BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN5" edc:mask="0x1" edc:name="FLTEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F6BP" edc:mask="0x1f" edc:name="F6BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN6" edc:mask="0x1" edc:name="FLTEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F7BP" edc:mask="0x1f" edc:name="F7BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN7" edc:mask="0x1" edc:name="FLTEN7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD1FLTCON2" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD1FLTCON2" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880760">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F8BP" edc:mask="0x1f" edc:name="F8BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN8" edc:mask="0x1" edc:name="FLTEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F9BP" edc:mask="0x1f" edc:name="F9BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN9" edc:mask="0x1" edc:name="FLTEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F10BP" edc:mask="0x1f" edc:name="F10BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN10" edc:mask="0x1" edc:name="FLTEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F11BP" edc:mask="0x1f" edc:name="F11BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN11" edc:mask="0x1" edc:name="FLTEN11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD1FLTCON3" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD1FLTCON3" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880770">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F12BP" edc:mask="0x1f" edc:name="F12BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN12" edc:mask="0x1" edc:name="FLTEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F13BP" edc:mask="0x1f" edc:name="F13BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN13" edc:mask="0x1" edc:name="FLTEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F14BP" edc:mask="0x1f" edc:name="F14BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN14" edc:mask="0x1" edc:name="FLTEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F15BP" edc:mask="0x1f" edc:name="F15BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN15" edc:mask="0x1" edc:name="FLTEN15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD1FLTCON4" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD1FLTCON4" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880780">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F16BP" edc:mask="0x1f" edc:name="F16BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN16" edc:mask="0x1" edc:name="FLTEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F17BP" edc:mask="0x1f" edc:name="F17BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN17" edc:mask="0x1" edc:name="FLTEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F18BP" edc:mask="0x1f" edc:name="F18BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN18" edc:mask="0x1" edc:name="FLTEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F19BP" edc:mask="0x1f" edc:name="F19BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN19" edc:mask="0x1" edc:name="FLTEN19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD1FLTCON5" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD1FLTCON5" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F880790">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F20BP" edc:mask="0x1f" edc:name="F20BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN20" edc:mask="0x1" edc:name="FLTEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F21BP" edc:mask="0x1f" edc:name="F21BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN21" edc:mask="0x1" edc:name="FLTEN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F22BP" edc:mask="0x1f" edc:name="F22BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN22" edc:mask="0x1" edc:name="FLTEN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F23BP" edc:mask="0x1f" edc:name="F23BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN23" edc:mask="0x1" edc:name="FLTEN23" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD1FLTCON6" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD1FLTCON6" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F8807A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F24BP" edc:mask="0x1f" edc:name="F24BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN24" edc:mask="0x1" edc:name="FLTEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F25BP" edc:mask="0x1f" edc:name="F25BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN25" edc:mask="0x1" edc:name="FLTEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F26BP" edc:mask="0x1f" edc:name="F26BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN26" edc:mask="0x1" edc:name="FLTEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F27BP" edc:mask="0x1f" edc:name="F27BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN27" edc:mask="0x1" edc:name="FLTEN27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
