Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ26" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ26" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK26" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK26" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ27" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ27" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK27" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK27" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ28" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ28" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK28" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK28" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ29" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ29" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK29" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK29" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ30" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ30" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK30" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK30" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F884B90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
