Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="CFD4RXIF" edc:desc="" edc:impl="0xfffffffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu-" edc:name="CFD4RXIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx-" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F885080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RFIF" edc:mask="0x7fffffff" edc:name="RFIF" edc:nzwidth="0x1f"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4TXIF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4TXIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F885090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFIF" edc:mask="0xffffffff" edc:name="TFIF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="CFD4RXOVIF" edc:desc="" edc:impl="0xfffffffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu-" edc:name="CFD4RXOVIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx-" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F8850A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RFOVIF" edc:mask="0x7fffffff" edc:name="RFOVIF" edc:nzwidth="0x1f"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4TXATIF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4TXATIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F8850B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFATIF" edc:mask="0xffffffff" edc:name="TFATIF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4TXREQ" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4TXREQ" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F8850C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0xffffffff" edc:name="TXREQ" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------rrrrrrrrrrrrrrrrrrrrrr" edc:cname="CFD4TREC" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CFD4TREC" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F8850D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RERRCNT" edc:desc="" edc:mask="0xff" edc:name="RERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="TERRCNT" edc:desc="" edc:mask="0xff" edc:name="TERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXWARN" edc:desc="" edc:mask="0x1" edc:name="RXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXWARN" edc:desc="" edc:mask="0x1" edc:name="TXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4BDIAG0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4BDIAG0" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F8850E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NRERRCNT" edc:mask="0xff" edc:name="NRERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NTERRCNT" edc:mask="0xff" edc:name="NTERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DRERRCNT" edc:mask="0xff" edc:name="DRERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DTERRCNT" edc:mask="0xff" edc:name="DTERRCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnn-nn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4BDIAG1" edc:desc="" edc:impl="0xfb3fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu--uuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4BDIAG1" edc:nzwidth="32" edc:por="xxxxx-xx--xxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F8850F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EFMSGCNT" edc:mask="0xffff" edc:name="EFMSGCNT" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="NBIT0ERR" edc:mask="0x1" edc:name="NBIT0ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NBIT1ERR" edc:mask="0x1" edc:name="NBIT1ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACKERR" edc:mask="0x1" edc:name="NACKERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NFORMERR" edc:mask="0x1" edc:name="NFORMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSTUFERR" edc:mask="0x1" edc:name="NSTUFERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCRCERR" edc:mask="0x1" edc:name="NCRCERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DBIT0ERR" edc:mask="0x1" edc:name="DBIT0ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBIT1ERR" edc:mask="0x1" edc:name="DBIT1ERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DFORMERR" edc:mask="0x1" edc:name="DFORMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTUFERR" edc:mask="0x1" edc:name="DSTUFERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCRCERR" edc:mask="0x1" edc:name="DCRCERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESI" edc:mask="0x1" edc:name="ESI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLCMM" edc:mask="0x1" edc:name="DLCMM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn-------------n-n--n-nnnn" edc:cname="CFD4TEFCON" edc:desc="" edc:impl="0x1f00052f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu-------------u-u--u-uuuu" edc:name="CFD4TEFCON" edc:nzwidth="32" edc:por="---xxxxx-------------x-x--x-xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F885100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEFNEIE" edc:mask="0x1" edc:name="TEFNEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFHIE" edc:mask="0x1" edc:name="TEFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFIE" edc:mask="0x1" edc:name="TEFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFOVIE" edc:mask="0x1" edc:name="TEFOVIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFTSEN" edc:mask="0x1" edc:name="TEFTSEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
