Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4MASK30" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4MASK30" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F885B90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4FLTOBJ31" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4FLTOBJ31" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F885BA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4MASK31" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4MASK31" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xbc0" edc:_addr="0x1F885BB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1440" edc:_addr="0x1F885BC0"/>
      <edc:SFRDef edc:access="nrnnnnnnnnnnnnnnn-nnnnn--nnnnnnn" edc:cname="ADCCON1" edc:desc="" edc:impl="0xffffbe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000110000000000-00000--0000uuu" edc:name="ADCCON1" edc:nzwidth="32" edc:por="00000110000000000-00000--0000xxx" edc:portals="CLR SET INV" ltx:baseofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMABL" edc:mask="0x7" edc:name="DMABL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:mask="0x1" edc:name="STRGLVL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:mask="0x7" edc:name="IRQVS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FSPBCLKEN" edc:mask="0x1" edc:name="FSPBCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSSCLKEN" edc:mask="0x1" edc:name="FSSCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AICPMPEN" edc:mask="0x1" edc:name="AICPMPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:mask="0x1f" edc:name="STRGSRC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FRACT" edc:mask="0x1" edc:name="FRACT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBSLV" edc:mask="0x7" edc:name="TRBSLV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBMST" edc:mask="0x7" edc:name="TRBMST" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBERR" edc:mask="0x1" edc:name="TRBERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBEN" edc:mask="0x1" edc:name="TRBEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ADC" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrnnnnnnnnnnnnnnnnn-nnn-nnnnnnn" edc:cname="ADCCON2" edc:desc="" edc:impl="0xfffff77f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000-000-0000000" edc:name="ADCCON2" edc:nzwidth="32" edc:por="00000000000000000000-000-0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEIOVR" edc:mask="0x1" edc:name="ADCEIOVR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSIEN" edc:mask="0x1" edc:name="EOSIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFFLTIEN" edc:mask="0x1" edc:name="REFFLTIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGVRIEN" edc:mask="0x1" edc:name="BGVRIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="10"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:mask="0x7" edc:name="CVDCPL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="EOSRDY" edc:mask="0x1" edc:name="EOSRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFFLT" edc:mask="0x1" edc:name="REFFLT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGVRRDY" edc:mask="0x1" edc:name="BGVRRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
