Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="nnnnnnnnr-rrrrrrnnnnnnnnnnnnnnnn" edc:cname="ADCCON3" edc:desc="" edc:impl="0xffbfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-0000000000000000000000" edc:name="ADCCON3" edc:nzwidth="32" edc:por="000000000-0000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADINSEL" edc:mask="0x3f" edc:name="ADINSEL" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="GSWTRG" edc:mask="0x1" edc:name="GSWTRG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GLSWTRG" edc:mask="0x1" edc:name="GLSWTRG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RQCNVRT" edc:mask="0x1" edc:name="RQCNVRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMP" edc:mask="0x1" edc:name="SAMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDRDY" edc:mask="0x1" edc:name="UPDRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDIEN" edc:mask="0x1" edc:name="UPDIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSUSP" edc:mask="0x1" edc:name="TRGSUSP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:mask="0x7" edc:name="VREFSEL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DIGEN0" edc:mask="0x1" edc:name="DIGEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN1" edc:mask="0x1" edc:name="DIGEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN2" edc:mask="0x1" edc:name="DIGEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN3" edc:mask="0x1" edc:name="DIGEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN4" edc:mask="0x1" edc:name="DIGEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN5" edc:mask="0x1" edc:name="DIGEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DIGEN7" edc:mask="0x1" edc:name="DIGEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CONCLKDIV" edc:mask="0x3f" edc:name="CONCLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCSEL" edc:mask="0x3" edc:name="ADCSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnnnnnnnnnn--nnnnnn--nnnnnn" edc:cname="ADCTRGMODE" edc:desc="" edc:impl="0xfff3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000000000--000000--000000" edc:name="ADCTRGMODE" edc:nzwidth="32" edc:por="----000000000000--000000--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSAMPEN0" edc:mask="0x1" edc:name="SSAMPEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN1" edc:mask="0x1" edc:name="SSAMPEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN2" edc:mask="0x1" edc:name="SSAMPEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN3" edc:mask="0x1" edc:name="SSAMPEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN4" edc:mask="0x1" edc:name="SSAMPEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSAMPEN5" edc:mask="0x1" edc:name="SSAMPEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="STRGEN0" edc:mask="0x1" edc:name="STRGEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN1" edc:mask="0x1" edc:name="STRGEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN2" edc:mask="0x1" edc:name="STRGEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN3" edc:mask="0x1" edc:name="STRGEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN4" edc:mask="0x1" edc:name="STRGEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGEN5" edc:mask="0x1" edc:name="STRGEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SH0ALT" edc:mask="0x3" edc:name="SH0ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH1ALT" edc:mask="0x3" edc:name="SH1ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH2ALT" edc:mask="0x3" edc:name="SH2ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH3ALT" edc:mask="0x3" edc:name="SH3ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH4ALT" edc:mask="0x3" edc:name="SH4ALT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SH5ALT" edc:mask="0x3" edc:name="SH5ALT" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCIMCON1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN0" edc:mask="0x1" edc:name="SIGN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF0" edc:mask="0x1" edc:name="DIFF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN1" edc:mask="0x1" edc:name="SIGN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:mask="0x1" edc:name="DIFF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN2" edc:mask="0x1" edc:name="SIGN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:mask="0x1" edc:name="DIFF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN3" edc:mask="0x1" edc:name="SIGN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:mask="0x1" edc:name="DIFF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN4" edc:mask="0x1" edc:name="SIGN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:mask="0x1" edc:name="DIFF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN5" edc:mask="0x1" edc:name="SIGN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:mask="0x1" edc:name="DIFF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN6" edc:mask="0x1" edc:name="SIGN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:mask="0x1" edc:name="DIFF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN7" edc:mask="0x1" edc:name="SIGN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:mask="0x1" edc:name="DIFF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN8" edc:mask="0x1" edc:name="SIGN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:mask="0x1" edc:name="DIFF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN9" edc:mask="0x1" edc:name="SIGN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:mask="0x1" edc:name="DIFF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN10" edc:mask="0x1" edc:name="SIGN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:mask="0x1" edc:name="DIFF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN11" edc:mask="0x1" edc:name="SIGN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:mask="0x1" edc:name="DIFF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN12" edc:mask="0x1" edc:name="SIGN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF12" edc:mask="0x1" edc:name="DIFF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN13" edc:mask="0x1" edc:name="SIGN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF13" edc:mask="0x1" edc:name="DIFF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN14" edc:mask="0x1" edc:name="SIGN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF14" edc:mask="0x1" edc:name="DIFF14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN15" edc:mask="0x1" edc:name="SIGN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF15" edc:mask="0x1" edc:name="DIFF15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="ADCIMCON2" edc:desc="" edc:impl="0xff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000--------00000000" edc:name="ADCIMCON2" edc:nzwidth="32" edc:por="--------00000000--------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN16" edc:mask="0x1" edc:name="SIGN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF16" edc:mask="0x1" edc:name="DIFF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN17" edc:mask="0x1" edc:name="SIGN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF17" edc:mask="0x1" edc:name="DIFF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN18" edc:mask="0x1" edc:name="SIGN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF18" edc:mask="0x1" edc:name="DIFF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN19" edc:mask="0x1" edc:name="SIGN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF19" edc:mask="0x1" edc:name="DIFF19" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIGN24" edc:mask="0x1" edc:name="SIGN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF24" edc:mask="0x1" edc:name="DIFF24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN25" edc:mask="0x1" edc:name="SIGN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF25" edc:mask="0x1" edc:name="DIFF25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN26" edc:mask="0x1" edc:name="SIGN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF26" edc:mask="0x1" edc:name="DIFF26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN27" edc:mask="0x1" edc:name="SIGN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF27" edc:mask="0x1" edc:name="DIFF27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------------" edc:cname="ADCIMCON3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="ADCIMCON3" edc:nzwidth="32" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="ADCIMCON4" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="ADCIMCON4" edc:nzwidth="32" edc:por="----------------------------0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN48" edc:mask="0x1" edc:name="SIGN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF48" edc:mask="0x1" edc:name="DIFF48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN49" edc:mask="0x1" edc:name="SIGN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF49" edc:mask="0x1" edc:name="DIFF49" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
