Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0512MCM064.PIC
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC0TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC0TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="16" edc:_begin="0x220" edc:_end="0x230" edc:_addr="0x1F887350">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC1TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC1TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="17" edc:_begin="0x220" edc:_end="0x230" edc:_addr="0x1F887360">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC2TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC2TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="18" edc:_begin="0x220" edc:_end="0x230" edc:_addr="0x1F887370">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC3TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC3TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="19" edc:_begin="0x220" edc:_end="0x230" edc:_addr="0x1F887380">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC4TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC4TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="20" edc:_begin="0x220" edc:_end="0x230" edc:_addr="0x1F887390">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC5TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC5TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="21" edc:_begin="0x220" edc:_end="0x230" edc:_addr="0x1F8873A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x1F8873B0"/>
      <edc:SFRDef edc:access="----nnnn----nnnnnnnnnnnnnnnnnnnn" edc:cname="ADCEIEN1" edc:desc="" edc:impl="0xf0fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----00000000000000000000" edc:name="ADCEIQEN1" edc:nzwidth="32" edc:por="----0000----00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:_begin="0x230" edc:_end="0x280" edc:_addr="0x1F8873C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN0" edc:mask="0x1" edc:name="EIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN1" edc:mask="0x1" edc:name="EIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN2" edc:mask="0x1" edc:name="EIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN3" edc:mask="0x1" edc:name="EIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN4" edc:mask="0x1" edc:name="EIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN5" edc:mask="0x1" edc:name="EIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN6" edc:mask="0x1" edc:name="EIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN7" edc:mask="0x1" edc:name="EIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN8" edc:mask="0x1" edc:name="EIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN9" edc:mask="0x1" edc:name="EIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN10" edc:mask="0x1" edc:name="EIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN11" edc:mask="0x1" edc:name="EIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN12" edc:mask="0x1" edc:name="EIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN13" edc:mask="0x1" edc:name="EIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN14" edc:mask="0x1" edc:name="EIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN15" edc:mask="0x1" edc:name="EIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN16" edc:mask="0x1" edc:name="EIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN17" edc:mask="0x1" edc:name="EIEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN18" edc:mask="0x1" edc:name="EIEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN19" edc:mask="0x1" edc:name="EIEN19" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN24" edc:mask="0x1" edc:name="EIEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN25" edc:mask="0x1" edc:name="EIEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN26" edc:mask="0x1" edc:name="EIEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN27" edc:mask="0x1" edc:name="EIEN27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------nnnnnn----------------" edc:cname="ADCEIEN2" edc:desc="" edc:impl="0x3f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000----------------" edc:name="ADCEIQEN2" edc:nzwidth="32" edc:por="----------000000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:_begin="0x230" edc:_end="0x280" edc:_addr="0x1F8873D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN48" edc:mask="0x1" edc:name="EIEN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN49" edc:mask="0x1" edc:name="EIEN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN50" edc:mask="0x1" edc:name="EIEN50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN51" edc:mask="0x1" edc:name="EIEN51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN52" edc:mask="0x1" edc:name="EIEN52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN53" edc:mask="0x1" edc:name="EIEN53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----rrrr----rrrrrrrrrrrrrrrrrrrr" edc:cname="ADCEISTAT1" edc:desc="" edc:impl="0xf0fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----00000000000000000000" edc:name="ADCEISTAT1" edc:nzwidth="32" edc:por="----0000----00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:_begin="0x230" edc:_end="0x280" edc:_addr="0x1F8873E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY0" edc:mask="0x1" edc:name="EIRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY1" edc:mask="0x1" edc:name="EIRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY2" edc:mask="0x1" edc:name="EIRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY3" edc:mask="0x1" edc:name="EIRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY4" edc:mask="0x1" edc:name="EIRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY5" edc:mask="0x1" edc:name="EIRDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY6" edc:mask="0x1" edc:name="EIRDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY7" edc:mask="0x1" edc:name="EIRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY8" edc:mask="0x1" edc:name="EIRDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY9" edc:mask="0x1" edc:name="EIRDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY10" edc:mask="0x1" edc:name="EIRDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY11" edc:mask="0x1" edc:name="EIRDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY12" edc:mask="0x1" edc:name="EIRDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY13" edc:mask="0x1" edc:name="EIRDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY14" edc:mask="0x1" edc:name="EIRDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY15" edc:mask="0x1" edc:name="EIRDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY16" edc:mask="0x1" edc:name="EIRDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY17" edc:mask="0x1" edc:name="EIRDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY18" edc:mask="0x1" edc:name="EIRDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY19" edc:mask="0x1" edc:name="EIRDY19" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY24" edc:mask="0x1" edc:name="EIRDY24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY25" edc:mask="0x1" edc:name="EIRDY25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY26" edc:mask="0x1" edc:name="EIRDY26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY27" edc:mask="0x1" edc:name="EIRDY27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
